/*---------------------------------------------------------------------------*
  Project:  NitroSDK - WM - include
  File:     wm.h

  Copyright 2003-2006 Nintendo.  All rights reserved.

  These coded instructions, statements, and computer programs contain
  proprietary information of Nintendo of America Inc. and/or Nintendo
  Company Ltd., and are protected by Federal copyright law.  They may
  not be disclosed to third parties or copied or duplicated in any form,
  in whole or in part, without the prior written consent of Nintendo.

  $Log: wm.h,v $
  Revision 1.166  2006/02/20 07:47:38  seiki_masashi
  Added WM_GAMEINFO_LENGTH_MIN

  Revision 1.165  2006/02/20 03:24:45  seiki_masashi
  Removed WMGameInfo.version and added magicNumber and ver 
  Changed name of WMGameInfo.gameNameCount_attribute to attribute 
  Removed support for WM_GAMEINFO_TYPE_OLD 

  Revision 1.164  2006/01/18 02:12:39  kitase_hirotake
  do-indent

  Revision 1.163  12/01/2005 16:06:09  seiki_masashi
  Added the maxSend/RecvDataSize structure field to the WMPortSend/RecvCallback structure.
  Added the parent/childSize field to the WMStartParent/ConnectCallback structure.

  Revision 1.162  12/01/2005 14:43:37  seiki_masashi
  Added maxFrequency and ignoreSizePrecheckMode to the WMMPParam structure.

  Revision 1.161  11/25/2005 14:04:32  seiki_masashi
  Added WMStatus.mp_parentInterval, mp_childInterval, mp_parentSize, and mp_childSize

  Revision 1.160  11/25/2005 04:01:58  seiki_masashi

// List of parameters that cannot be set during MP communications
#define WM_MP_PARAM_MUST_SET_BEFORE_MP      (WM_MP_PARAM_MIN_POLL_BMP_MODE|WM_MP_PARAM_SINGLE_PACKET_MODE|WM_MP_PARAM_IGNORE_SIZE_PRECHECK_MODE)

// Maximum parameter value
#define WM_MP_PARAM_INTERVAL_MAX 10000 // The value set to interval must be 10000us or lower.

// WM API callback type
typedef void (*WMcallbackFunc) (void *arg);     // WM API callback type
typedef void (*WMCallbackFunc) (void *arg);     // WM API callback type

// Buffer size =======================================================================

//„¡„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„¢
//„  WM9 variable       „  512
//„¥„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„§
//„  WM7 variable       „  256 + 512
//„¥„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„§
//„  WM status          „  2048
//„¥„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„§
//„  FIFO buf (9 ¨ 7)  „  256
//„¥„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„§
//„  FIFO buf (9 © 7)  „  256
//„¤„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„Ÿ„£

// Size of the buffer used with WM -------------------

#define WM_ARM9WM_BUF_SIZE      512    // Size of the WM variable area on ARM9
#define WM_ARM7WM_BUF_SIZE      ( 256 + 512 )   // Size of the WM variable area on ARM7
#define WM_STATUS_BUF_SIZE      2048   // Size of the WM status area
#define WM_FIFO_BUF_SIZE        256    // Size of the FIFO command buffer between ARM9 and ARM7

// Size of the buffer allocated by the user -------------
//   Size of all buffers used by WM system 512 + 256 + 512 + 2048 + 256 + 256 = 0xf00 (Notice that this is FIFO_BIF * 2)
#define WM_SYSTEM_BUF_SIZE      (WM_ARM9WM_BUF_SIZE + WM_ARM7WM_BUF_SIZE + WM_STATUS_BUF_SIZE + WM_FIFO_BUF_SIZE + WM_FIFO_BUF_SIZE)
#define WM_BSS_DESC_SIZE        192    // Size of the buffer for storing parent information passed by WM_StartScan()

#define WM_DCF_MAX_SIZE         1508   // Maximum size that can be received with DCF
#define WM_KEYSET_SIZE          36     // Size of KeySet
#define WM_KEYDATA_SIZE         2      // Size of KeyData

#define WM_DS_HEADER_SIZE       4

#ifdef WM_DS_DATA_SIZE_252             // When it is OK to set 252 for WM_DS_DATA_SIZE
#define WM_DS_DATA_SIZE         252
#else  // When WM_DS_DATA_SIZE is 508 (default)
#define WM_DS_DATA_SIZE         508    // Maximum data size of one WMDataSet (512-4)
                                       // WM_DS_DATA_SIZE+WM_DS_HEADER_SIZE needs to be the multiples of 32
#endif

#define WM_DS_DATASET_NUM       4      // How many WMDataSet to be kept in WMDataSetBuf (fixed value)
#define WM_DS_INFO_SIZE         (sizeof(WMDataSharingInfo))     // Buffer size for DataSharing

#define WM_SCAN_EX_PARENT_MAX   16     // Maximum number of parent that can be found with one ScanEx
#define WM_SCAN_OTHER_ELEMENT_MAX 16   // Max. number of otherElement that can be acknowledged

/*---------------------------------------------------------------------------*
    structure definitions
 *---------------------------------------------------------------------------*/

// Buffer structure =======================================================================

// Data set structure
typedef struct WMDataSet
{
//    u16 seqNum;                 // data set sequential number
    u16     aidBitmap;
    u16     receivedBitmap;            // Bit map of receive status
    u16     data[WM_DS_DATA_SIZE / sizeof(u16)];        // Shared data

}
WMDataSet;

// DataSharing information structure
typedef struct WMDataSharingInfo
{
    WMDataSet ds[WM_DS_DATASET_NUM];
    u16     seqNum[WM_DS_DATASET_NUM]; // Sequential Number
    u16     writeIndex;                // Next Index to write
    u16     sendIndex;                 // Index currently being sent
    u16     readIndex;                 // Next Index to read
    u16     aidBitmap;                 // bitmap of data sharing group (including self)
    u16     dataLength;                // Amount of data shared around one machine   
    u16     stationNumber;             // Number of machines sharing data (number of bits set in aidBitmap)
    u16     dataSetLength;             // dataLength * stationNumber
    u16     port;                      // Port being used (port number = at least 8)
    u16     doubleMode;                // In mode for alternately sending/receiving each frame?
    u16     currentSeqNum;             // The last DataSet SeqNum that was read
    u16     state;                     // Current DataSharing state (WMDataSharingState)
    u16     reserved[1];               // for 32Byte Alignment
}
WMDataSharingInfo;

// Key set structure
typedef struct WMKeySet
{
    u16     seqNum;                    // Key set's sequential number
    u16     rsv;
    u16     key[16];                   // Key data

}
WMKeySet, WMkeySet;

// Ring buffer for holding key set
typedef WMDataSharingInfo WMKeySetBuf, WMkeySetBuf;

//---------------------------------------
// Parent/Child shared MP port send queue structure
typedef struct
{
    u16     next;
    u16     port;
    u16     destBitmap;
    u16     restBitmap;
    u16     sentBitmap;
    u16     sendingBitmap;
    u16     padding;
    u16     size;
    u16     seqNo;
    u16     retryCount;
    const u16 *data;
    WMCallbackFunc callback;
    void   *arg;
}
WMPortSendQueueData;

typedef struct
{
    u16     head;
    u16     tail;
}
WMPortSendQueue;

//---------------------------------------
// Child MP receive buffer structure
typedef struct WMMpRecvBuf
{
    u16     rsv1[3];
    u16     length;

    u16     rsv2[1];
    u16     ackTimeStamp;
    u16     timeStamp;
    u16     rate_rssi;
    u16     rsv3[2];

    u16     rsv4[2];
    u8      destAdrs[6];
    u8      srcAdrs[6];
    u16     rsv5[3];
    u16     seqCtrl;

    u16     txop;
    u16     bitmap;
    u16     wmHeader;
    u16     data[2];

}
WMMpRecvBuf, WMmpRecvBuf;

//---------------------------------------
// Parent MP receive buffer structure
typedef struct WMMpRecvData
{
    u16     length;
    u16     rate_rssi;
    u16     aid;
    u16     noResponse;
    u16     wmHeader;
    u16     cdata[1];

}
WMMpRecvData, WMmpRecvData;

typedef struct WMMpRecvHeader
{
    u16     bitmap;
#if SDK_VERSION_WL >= 20500
    u16     errBitmap;
#endif
    u16     count;
    u16     length;
    u16     txCount;
    WMMpRecvData data[1];

}
WMMpRecvHeader, WMmpRecvHeader;

//---------------------------------------
// Child DCF receive buffer structure
typedef struct WMDcfRecvBuf
{
    u16     frameID;
    u16     rsv1[2];
    u16     length;

    u16     rsv2[3];
    u16     rate_rssi;
    u16     rsv3[4];
    u8      destAdrs[6];
    u8      srcAdrs[6];
    u16     rsv4[4];

    u16     data[2];

}
WMDcfRecvBuf, WMdcfRecvBuf;

//---------------------------------------
// WM parent parameter structure
typedef struct WMParentParam
{
    u16    *userGameInfo;              // Pointer to data to set in user area
    u16     userGameInfoLength;        // Length of user area
    u16     padding;

    u32     ggid;
    u16     tgid;                      // Temporary GameID(generated each time a user becomes a parent)
    u16     entryFlag;                 // Connect possible, 0: Connect not possible
    u16     maxEntry;                  // Number of children that can connect
    u16     multiBootFlag;             // 1: Multiboot possible, 0: Multiboot not possible
    u16     KS_Flag;                   // 1: KeySharing, 0: Not KeySharing
    u16     CS_Flag;                   // 1: Continuous send, 0: Send one frame at a time
    u16     beaconPeriod;              // Beacon interval (ms)
    u16     rsv1[WM_SIZE_USERNAME / sizeof(u16)];       //
    u16     rsv2[WM_SIZE_GAMENAME / sizeof(u16)];       //
    u16     channel;                   // Channel
    u16     parentMaxSize;             // Maximum parent transfer size
    u16     childMaxSize;              // Maximum child transfer size

    u16     rsv[4];                    // For 32-byte alignment

}
WMParentParam, WMpparam;

//---------------------------------------
// WM GameInfo Structure

typedef struct WMGameInfo
{
    u16     magicNumber;               // == 0x0001
    u8      ver;                       // GameInfo Version 0
    u8      reserved[1];
    u32     ggid;
    u16     tgid;
    u8      userGameInfoLength;        // Length of user area
    union
    {
        // (CS_Flag):1, (KS_Flag):1, multibootFlag:1, entryFlag:1
        u8      gameNameCount_attribute;   // Old name for compatibility purposes
        u8      attribute;
    };
    u16     parentMaxSize;             //Maximum parent transfer size
    u16     childMaxSize;              //Maximum child transfer size
    union
    {
        u16     userGameInfo[WM_SIZE_USER_GAMEINFO / sizeof(u16)];      // User region (Maximum: 112 bytes (provisional))
        struct
        {
            u16     userName[WM_SIZE_USERNAME / sizeof(u16)];   // WM_SIZE_USERNAME -> 8
            u16     gameName[WM_SIZE_GAMENAME / sizeof(u16)];   // WM_SIZE_GAMENAME -> 16
            u16     padd1[44];         // pad -> 88
        }
        old_type;                      // Total: 112 bytes
    };
}
WMGameInfo, WMgameInfo;

//---------------------------------------
// BSSDescription. Parent information structure (Acquired with Scan. Used for Connect specification)
#if SDK_VERSION_WL < 17100
typedef struct WMBssDesc
{
    u16     length;                    // 2
    u16     rssi;                      // 4
    u8      bssid[WM_SIZE_BSSID];      // 10
    u16     ssidLength;                // 12
    u8      ssid[WM_SIZE_SSID];        // 44
    u16     capaInfo;                  // 46
    struct
    {
        u16     basic;                 // 48
        u16     support;               // 50
    }
    rateSet;
    u16     beaconPeriod;              // 52
    u16     dtimPeriod;                // 54
    u16     channel;                   // 56
    u16     cfpPeriod;                 // 58
    u16     cfpMaxDuration;            // 60
    u16     gameInfoLength;            // 62
    WMGameInfo gameInfo;               // 190
    u16     rsv;                       // 192

}
WMBssDesc, WMbssDesc;
#else
typedef struct WMBssDesc
{
    u16     length;                    // 2
    u16     rssi;                      // 4
    u8      bssid[WM_SIZE_BSSID];      // 10
    u16     ssidLength;                // 12
    u8      ssid[WM_SIZE_SSID];        // 44
    u16     capaInfo;                  // 46
    struct
    {
        u16     basic;                 // 48
        u16     support;               // 50
    }
    rateSet;
    u16     beaconPeriod;              // 52
    u16     dtimPeriod;                // 54
    u16     channel;                   // 56
    u16     cfpPeriod;                 // 58
    u16     cfpMaxDuration;            // 60
    u16     gameInfoLength;            // 62
    u16     otherElementCount;         // 64
    WMGameInfo gameInfo;               // 192

}
WMBssDesc, WMbssDesc;
#endif

//---------------------------------------
// Extended element structure in WM beacon
typedef struct WMOtherElements
{
    u8      count;
    u8      rsv[3];
    struct
    {
        u8      id;
        u8      length;
        u8      rsv[2];
        u8     *body;
    }
    element[WM_SCAN_OTHER_ELEMENT_MAX];
}
WMOtherElements;

//---------------------------------------
// WM Scan parameter Structure
typedef struct WMScanParam
{
    WMBssDesc *scanBuf;                // Buffer that stores parent information
    u16     channel;                   // Channel for scanning
    u16     maxChannelTime;            // Maximum Scan time
    u8      bssid[WM_SIZE_BSSID];      // MacAddress of Scan target parent (all parents become target if 0xff)
    u16     rsv[9];

}
WMScanParam, WMscanParam;

//---------------------------------------
// WM ScanEx parameter structure
typedef struct WMScanExParam
{
